{
    "date": "Nov 14, 2022",
    "version": "3.1.0",
    "changelog": "Added:\n• DiscordAcePerms\n(*Give someone in the server permissions based on the roles they have on discord*)\n• Identifier spoilers\n(*This gives you the option to hide identifiers so you won't accidentally share them*)\n• Discord Timeout check\n(*Checks if the player has a timeout on discord when they join and deny them from joining the server*)\n• Language files\n(*If you want to help make more translations available let us know*)\n• Screenshot the second player with exports\n(*you can now add screenshots for the second player as well*)\n• Optional custom color, title and icon for exports.\n(*You can now send exports to the same channel with a different color, title and icon*) \nChanged:\n• Main look of embeds \n(*https://prefech.com/view/071122-181921-155*)\n• Screenshots will be posted in a second embed\n(* The second embed will be in the same message*)\nRemoved:\n• The need for a second bot.\nFixed:\n• WeaponsNotLogged from the config will not be logged.\nNotes:\n• DiscordAcePerms and TimeoutCheck require you to have a guildId set in the config.json\n• Export after last update:\n```lua\nexports.JD_logsV3:createLog(*{\n    EmbedMessage = \"Embed Message\", -- The Embed Message you want to show in the export.\n    player_id = SERVER_ID_PLAYER_ONE, -- Server id for the first player (*Optional*)\n    player_2_id = SERVER_ID_PLAYER_TWO, -- Server if for the second player (*Optional*)\n    channel = \"Channel name from channels.json | Discord Channel ID | Discord Webhook URL\", -- You have 3 options here.\n    screenshot = true, -- Make a screenshot of the first player (*Optional*)\n    screenshot_2 = true, -- Make a screenshot of the second player (*Optional*)\n    title = 'Custom Title', -- Set a custom title for this export (*Optional*)\n    color = '#A1A1A1', -- Set a custom color for this export (*Optional*)\n    icon = '✅' -- Set a custom icon for this export (*Requires Custom Title*) (*Optional*)\n}*)\n```"
}
